/* This is a mapping of BRError code failures to localized failure reasons */

/* kBRMediaManagerErrorNoPlayer*/
100 = "Impossibile riprodurre il contenuto selezionato.";


/* kBRMediaPlayerNoDatabaseFound*/
200 = "Impossibile trovare contenuti.";

/* kBRMediaPlayerSongPlaybackError*/
201 = "Impossibile riprodurre il brano attuale.";


/* kBRMediaNoContent*/
300 = "Non è stato trovato alcun contenuto.";

/* kBRMediaNoPhotoContent */
301 = "Non ci sono foto nella libreria iPhoto.";

/* kBRMediaNoPodcastContent */
302 = "Non ci sono podcast nella libreria iTunes.";

/* kBRMediaNotDRMAuthorized */
303 = "Non sei autorizzato a riprodurre questo contenuto.";

/* kBRMediaNoMovieFolderContent */
304 = "Non ci sono filmati da riprodurre nella cartella Filmati.";

/* kBRMediaNoTVShowContent */
305 = "Non ci sono spettacoli TV nella libreria iTunes.";

/* kBRMediaNoMusicVideoContent */
306 = "Non ci sono videoclip nella libreria iTunes.";

/* kBRMediaNoPlaylists */
307 = "Non ci sono playlist nella libreria iTunes.";

/* kBRMediaNoSongContent */
308 = "Non ci sono brani nella libreria iTunes.";

/* kBRMediaNoAudioBookContent */
309 = "Non ci sono audiolibri nella libreria iTunes.";

/* kBRMediaEmptyPlaylist */
310 = "Non ci sono brani nella playlist.";

/* kBRMediaNoSuchPlaylist */
311 = "Impossibile trovare la playlist selezionata.";

/* kBRMediaNoSuchSong */
312 = "Impossibile trovare il brano selezionato.";

/* kBRMediaNoMovies */
315 = "Non ci sono filmati nella cartella Filmati.";

/* kBRMediaNoSongForSlideshow */
316 = "Il brano in questa presentazione non può essere riprodotto.";

/* kBRMediaSongPlaybackErrorDuringSlideshow */
317 = "Il brano in questa presentazione non può essere riprodotto.";

/* kBRVideoUnplayable */
318 = "Non è stato possibile riprodurre il video selezionato.";

/* kBRMediaRadioStreamUnplayable */
319 = "Impossibile riprodurre lo stream radiofonico selezionato.";

/* kBRRemoteMediaNoContent*/
350 = "Non è stato trovato alcun contenuto in questa libreria.";

/* kBRRemoteMediaNoPhotoContent */
351 = "Non ci sono foto in questa libreria.";

/* kBRRemoteMediaNoPodcastContent */
352 = "Non ci sono podcast in questa libreria.";

/* kBRRemoteMediaNotDRMAuthorized */
353 = "Non sei autorizzato a riprodurre questo contenuto.";

/* kBRRemoteMediaNoTVShowContent */
355 = "Non ci sono spettacoli TV in questa libreria.";

/* kBRRemoteMediaNoMusicVideoContent */
356 = "Non ci sono videoclip in questa libreria.";

/* kBRRemoteMediaNoPlaylists */
357 = "Non ci sono playlist in questa libreria.";

/* kBRRemoteMediaNoSongContent */
358 = "Non ci sono brani in questa libreria.";

/* kBRRemoteMediaNoAudioBookContent */
359 = "Non ci sono audiolibri in questa libreria.";

/* kBRRemoteMediaEmptyPlaylist */
360 = "Non ci sono brani nella playlist.";

/* kBRRemoteMediaLoadingError */
361 = "Si è verificato un errore nel caricare questo contenuto.";

/* kBRRemotePhotoSourceUnavailableError */
363 = "La sorgente per la condivisione delle foto non è disponibile.";

/* kBRDataSourceInitializationFailure*/
400 = "Non è stato trovato alcun contenuto.";

/* kBRDataSourceURLResolutionFailure*/
410 = "Non è stato trovato alcun contenuto.";

/* kBRDataSourceConnectionInProgressError */
420 = "Tentativo di collegarsi a questa sorgente in corso.";


/* KBRSystemNetworkHostUnreachable */
501 = "Impossibile collegarsi a questa libreria.";

/* kBRSystemErrorTrailerSiteUnreachable */
502 = "Impossibile riprodurre il filmato in questo momento.";

/* kBRSystemNotHDCPCompliant */
503 = "Per poter riprodurre questo contenuto è necessario HDCP.";

/* kBRSetupCantSetLanguage */
600 = "Impossibile cambiare la lingua.";


/* kBRDVDErrorCantInitializeDVDPlaybackAlert */
750 = "Impossibile riprodurre un DVD in questo momento.";

/* kBRDVDErrorCantEjectDVDAlert */
751 = "Impossibile espellere il DVD.";

/* kBRDVDErrorBadRegionCodeAlert */
752 = "Il codice regionale del DVD non corrisponde al DVD Player.";

/* kBRDVDErrorBadDVDMediaAlert */
753 = "Impossibile riprodurre il DVD.";

/* kBRDVDErrorFatalDVDAlert */
754 = "Impossibile riprodurre il DVD.";

/* kBRCDErrorCantEjectCDAlert */
755 = "Impossibile espellere il CD.";

/*	kDVDErrorAuthentification = -70025,	The user attempting to change the region code could not be authenticated. */
-70025 = "Impossibile verificare la protezione contro la copia del disco.";

/* kBRInternalResourceError */
900 = "Si è verificato un errore.";

